|       | Описание                                                                                                          |
|-------|-------------------------------------------------------------------------------------------------------------------|
|       | Создать внешний репозиторий c названием JSON.                                                                      |
|       | Клонировать репозиторий JSON на локальный компьютер. `git clone https://github.com/...`                           |
|       | Внутри локального JSON создать файл “new.json”. `touch new.json`                                                |
|       | Добавить файл под гит. `git add new.json`                                                                        |
|       | Закоммитить файл. `git commit -m "1"`                                                                            |
|       | Отправить файл на внешний GitHub репозиторий. `git push`                                                       |
|       | Отредактировать содержание файла “new.json” - написать информацию о себе (ФИО, возраст, количество домашних животных, будущая желаемая зарплата). Всё написать в формате JSON. `echo "..." >> new.json` |
|       | Отправить изменения на внешний репозиторий. `git commit -a -m "2"`                                            |
|       | Создать файл preferences.json. `touch preferences.json`                                                        |
|       | В файл preferences.json добавить информацию о своих предпочтениях (Любимый фильм, любимый сериал, любимая еда, любимое время года, сторона которую хотели бы посетить) в формате JSON. `nano preferences.json` |
|       | Создать файл skills.json, добавить информацию о скиллах, которые будут изучены на курсе в формате JSON. `touch skills.json`, `nano skills.json` |
|       | Отправить сразу 2 файла на внешний репозиторий. `git add preferences.json skills.json`, `git commit -m "Add preferences.json and skills.json"`, `git push` |
|       | На веб-интерфейсе создать файл bug_report.json.                                                                 |
|       | Сделать Commit changes (сохранить) изменения на веб-интерфейсе.                                                 |
|       | На веб-интерфейсе модифицировать файл bug_report.json, добавить баг репорт в формате JSON.                     |
|       | Сделать Commit changes (сохранить) изменения на веб-интерфейсе.                                                 |
|       | Синхронизировать внешний и локальный репозиторий JSON. `git pull`                                              |
